# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
#------------------------------------------------------------------------
a = int(input(' Введите цыфру от 1 до 7 = '))
if 0 < a < 6:
    print(" Заданный день не является выходным")
else:
    print(" Заданный день является выходным")
print(" Программа работу закончила ")
# ----------------------------------------------------------------------------
b = int(input(' Введите цыфру от 1 до 7 = '))
print()
if b == 6 or b == 7:
    print(" Заданный день не является выходным")
else:
    print(" Заданный день является выходным")
print()
print(" Программа работу закончила ")
#---------------------------------------------------------------------------