# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.
# ------------------------------------------------------------------------------------
x1 = int(input(' Введите x1 = '))
y1 = int(input(' Введите y1 = '))
x2 = int(input(' Введите x2 = '))
y2 = int(input(' Введите y2 = '))
dist = ((x2 - x1)**2 + (y2 - y1)**2)**0.5
print(' Расстояние между жвумя точками =', dist )
print(' Программа работу закончила ' )
# ------------------------------------------------------------------------------------
import math
x1 = int(input(' Введите x1 = '))
y1 = int(input(' Введите y1 = '))
x2 = int(input(' Введите x2 = '))
y2 = int(input(' Введите y2 = '))
pifagor = math.sqrt((x2 - x1)**2 + (y2 - y1)**2)
print(' Расстояние между жвумя точками =', pifagor )
print(' Программа работу закончила ' )
# ------------------------------------------------------------------------------------
